export/issues/9.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-05 Fri 01:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Grolter Bell" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-org4fbc5b0" class="outline-2">
<h2 id="org4fbc5b0"><span class="section-number-2">1.</span> Issue 9 (Empty package local name)</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7a6b6d8" class="outline-3">
<h3 id="org7a6b6d8"><span class="section-number-3">1.1.</span> Description</h3>
<div class="outline-text-3" id="text-1-1">
<p>
It is not clear whether it should be allowed to use <code>""</code> as a local nickname,
and in the case this is allowed, whether it should affect the <code>:xxxx</code> syntax.
</p>
</div>
</div>
<div id="outline-container-org70b68ac" class="outline-3">
<h3 id="org70b68ac"><span class="section-number-3">1.2.</span> Examples</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-common-lisp">(<span style="color: #8ac6f2; font-weight: bold;">defpackage</span> <span style="color: #e5786d;">#:foo</span>
  (<span style="color: #e5786d;">:use</span> <span style="color: #e5786d;">#:cl</span>)
  (<span style="color: #e5786d;">:local-nicknames</span> (<span style="color: #95e454;">""</span> <span style="color: #e5786d;">#:cl</span>)))

(<span style="color: #8ac6f2; font-weight: bold;">in-package</span> <span style="color: #e5786d;">#:foo</span>)

(package-name (symbol-package '<span style="color: #e5786d;">:*package*</span>))
<span style="color: #99968b;">; </span><span style="color: #99968b;">=&gt; "KEYWORD"  (sbcl, ccl, ecl, abcl, clasp, lispworks)</span>
<span style="color: #99968b;">; </span><span style="color: #99968b;">=&gt; "COMMON-LISP"  (acl)</span>

(package-name (symbol-package '||<span style="color: #e5786d;">:*package*</span>))
<span style="color: #99968b;">; </span><span style="color: #99968b;">=&gt; "KEYWORD"  (ecl, clasp, lispworks)</span>
<span style="color: #99968b;">; </span><span style="color: #99968b;">=&gt; "COMMON-LISP"  (sbcl, ccl, acl)</span>
<span style="color: #99968b;">; </span><span style="color: #99968b;">abcl errors</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org324b97f" class="outline-3">
<h3 id="org324b97f"><span class="section-number-3">1.3.</span> Current behavior</h3>
<div class="outline-text-3" id="text-1-3">
<p>
sbcl, ccl:
<code>:xxxx</code> is read as a keyword;
<code>||:xxxx</code> is read as a symbol in the package named or nicknamed <code>""</code>.
</p>

<p>
ecl, clasp, lispworks:
<code>||:xxxx</code> and <code>:xxxx</code> are read as a keyword.
</p>

<p>
acl:
<code>:xxxx</code> and <code>||:xxxx</code> are read as a symbol in the package named or nicknamed <code>""</code>.
<code>""</code> is by default a global nickname for the <code>#:KEYWORD</code> package.
</p>

<p>
abcl:
<code>:xxxx</code> is read as a keyword;
<code>||:xxxx</code> syntax cannot be read (attemts result in an error).
</p>
</div>
</div>
<div id="outline-container-org5d684ec" class="outline-3">
<h3 id="org5d684ec"><span class="section-number-3">1.4.</span> Proposal ALLOW-BUT-KEEP-KEYWORDS</h3>
<div class="outline-text-3" id="text-1-4">
<p>
The <code>""</code> local nickname should be explicitely allowed. <code>:xxxx</code> should be always
read as a keyword regardless of package names or nicknames. <code>||:xxxx</code> should be
read as a symbol in the package named or nicknamed by <code>""</code>.
</p>
</div>
</div>
<div id="outline-container-org2f5c8ef" class="outline-3">
<h3 id="org2f5c8ef"><span class="section-number-3">1.5.</span> Proposal ALLOW-FUN</h3>
<div class="outline-text-3" id="text-1-5">
<p>
The <code>""</code> local nickname should be explicitely allowed. Both <code>:xxxx</code> and <code>||:xxxx</code>
should be read as a symbol in the package named or nicknamed by <code>""</code>.
</p>
</div>
</div>
<div id="outline-container-org34755a7" class="outline-3">
<h3 id="org34755a7"><span class="section-number-3">1.6.</span> Links</h3>
<div class="outline-text-3" id="text-1-6">
<p>
See <a href="https://github.com/s-expressionists/wscl/issues/63">WSCL issue 63</a>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Grolter Bell</p>
<p class="date">Created: 2024-07-05 Fri 01:56</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
